import Link from "next/link";
const tree = [
	{
		name: "Кіші жүз",
		taipas: [
			{
				taipa: "алимулы",
				ru: [
					"шекты",
					"каракесек",
					"карасакал",
					"кете",
					"торткара",
					"шомекей",
				],
			},
			{
				taipa: "байулы",
				ru: [
					"шеркеш",
					"адай",
					"алаша",
					"алтын",
					"байбакты",
					"берш",
					"есентемир",
					"жаппас",
					"кызыл-курт",
					"маскар",
					"таз",
					"тана",
					"ысык",
				],
			},
			{
				taipa: "жетыру",
				ru: [
					"тама",
					"табын",
					"кердери",
					"кереит",
					"телеу",
					"рамадан",
					"жагалбайлы",
				],
			},
		],
	},
	{
		name: "Орта жүз",
		taipas: [
			{
				taipa: "аргыны",
				ru: [
					"шоган",
					"асан",
					"казбанбет",
					"жарты",
					"алжан",
					"курман",
					"айт",
					"бозым",
					"кыстык",
				],
			},
			{
				taipa: "найманы",
				ru: ["шыбыл", "коныр-борик", "кызыл-борик"],
			},
			{
				taipa: "кипчаки",
				ru: ["ботпай", "жаныс", "сикым", "шымыр"],
			},
		],
	},
	{
		name: "Ұлы жүз",
		taipas: [
			{
				taipa: "албан",
				ru: [
					"сары",
					"шоган",
					"асан",
					"казбанбет",
					"жарты",
					"алжан",
					"курман",
					"айт",
					"бозым",
					"кыстык",
				],
			},
			{
				taipa: "дулат",
				ru: [
					"ошакты",
					"суаны",
					"шапырашты",
					"ысты",
					"сары уйсын",
				],
			},
			{
				taipa: "канлы",
				ru: ["кара-канлы", "кзыл-канлы", "сары-канлы"],
			},
			{
				taipa: "жалайыры",
				ru: [
					"сырманак",
					"арыктыным",
					"байчигир",
					"балгалы",
					"кайшылы",
					"кушук",
					"шуманак",
					"андас",
					"мырза",
					"карашапал",
					"оракты",
					"акбиюм",
					"кальпе",
					"сыпатай",
					"бирманак",
					"сиырши",
				],
			},
			{
				taipa: "сиргели",
				ru: [
					"уштанбалы",
					"тутанбалы",
					"кайшылы",
					"конирдек",
				],
			},
			{
				taipa: "шанышкылы",
				ru: ["курбака", "балык", "санырау", "мамыт"],
			},
			{
				taipa: "шакшам",
				ru: ["дархан"],
			},
			{
				taipa: "ботпай",
				ru: ["жаныс", "сикым", "шымыр"],
			},
			{
				taipa: "аталык",
				ru: ["байлы", "коныр", "тасжурек"],
			},
			{
				taipa: "байтюгей",
				ru: ["токарстан", "багыс", "сартай", "нартай"],
			},
			{
				taipa: "екей",
				ru: ["еміл", "асыл", "шыбыл", "айкым"],
			},
			{
				taipa: "ойык",
				ru: ["тилик"],
			},
			{
				taipa: "калша",
				ru: ["жакып"],
			},
			{
				taipa: "айтым",
				ru: ["сары", "абыша", "кара", "имам", "жанибек"],
			},
		],
	},
];

const Branch = (branch) => {
	console.log(branch);
	return <>{branch.name}</>;
};

const Tree = () => {
	const branches = tree.map((branch) => {
		<Branch branch={branch} />;
	});
	return <ul>{branches}</ul>;
};

export default Tree;
